#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5d3168e0-35c2-4acf-9229-1fded4bd5b92]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7bf4efe9-0624-496b-9d8c-e38d59476a9b]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b4a5bc38-c60b-4e61-8e2e-847b6b5b269a]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c19c1445-de42-4e96-8658-14beb557c599]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8a6e6a22-5b6d-4641-9130-75e7d56c8e8c]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2b5acd4e-a4ba-43c7-ab51-09f742ff313a]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d60fed94-d59d-4356-8e8f-0227b6093d86]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ca58417e-c980-400f-a44d-f6a32f488f45]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=76b989b0-9c3f-4831-89ee-34d2743d6728]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6f20e6c8-e6c4-43f9-a7c6-9d15ccc6788a]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=aeef11d5-97d0-4f86-996e-47af535796a8]
module.keycloak_prod.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=accb4620-9139-4614-adcf-c6cee0a5cee6]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4b5d78f5-f3a4-403f-b113-7b44efc670f1]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=840c3579-34b1-4539-bb0b-5c72a2371696]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dd0debd3-bb0d-4cfa-b37c-078f86bf2e2e]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=eee4618e-eecd-404c-a226-de04e6326831]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=52080724-7d1e-463a-819d-86415972f2b0]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1192dd1d-933d-4695-9db5-6cb95f68dfa8]
module.keycloak_prod.module.onestopauth.module.client_feb-28-pm-test-2-idir-sso-admin-edits-5909.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=24ccdc8b-c302-434e-b6f4-4521fff59f8d]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4850dbc0-5e81-45b2-96c8-367d4e80b0f7]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=76da18c1-698a-4cac-98d1-f96e42fea05f]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=491a573e-c393-402a-be09-616c16b164f1]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0259a363-869c-4442-ace2-9e6bff714846]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2c0c29e8-f470-4836-85e1-b8269d4a7001]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e01b4353-6cd4-42d8-80a7-b82ec3a10e16]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3304da8b-80ef-4cad-8731-3bdffaa5841d]
module.keycloak_prod.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=98622929-a467-4fdb-87a5-f5a30c2cd6d9]
module.keycloak_prod.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e68683c1-2c8d-42c2-be14-f5d15204efb8]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1063a59d-6c8c-4926-b66b-092fa4a9d848]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04c24d57-2ce2-4f79-8d82-44eaed51cde6]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7664b246-131a-4659-afb6-dd33d238f10b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f8a805fc-2b9b-403a-be71-8c398e41403b]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3a1046b2-f84f-478d-8660-daf21b43de9c]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9cdea73c-48fe-4686-b513-333e7f52d6ed]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f01faa6a-3ed7-4ba9-997b-f0e700b4f298]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=99f9c885-065a-4ff4-94f5-db959a8a20eb]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=113ae672-7094-4d95-95a0-cf4011434621]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=551827fd-fea0-406b-a02e-4f3f4488300e]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=55ebdfbe-0d2d-4e25-b67d-6ddfca304424]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5dc8fb13-4de8-4985-b725-ac18bdc749f2]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=79e57f21-9dfa-482a-a3ba-54a9deee38dd]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2e997cac-72fb-4b7a-a2da-8cb5bb012254]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=45d40881-2d3a-4a1b-95a9-77082e21aca4]
module.keycloak_prod.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6718c50a-5b43-48a1-a308-2bbb573dd8d2]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a97f8d65-8bdf-40bf-9861-cdedb7823ab2]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=68f25c92-da3a-463d-8c17-a85d2505c040]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3eabec79-8d9b-4468-b702-22e6bbc19cb7]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6278e041-db21-4e67-8f39-54471e5ef0e1]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c521c294-6011-4021-bb19-df0c4fcfeeec]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=af998328-19ae-4315-b74c-9778ae964a60]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ad2d066f-0af2-4dad-b954-e5fe318f905c]
module.keycloak_prod.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e88d5162-52f2-46db-9421-daf36dc35e9d]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=098aa9bd-9a8e-4529-90eb-fa8f420f823d]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b9b17d88-d20f-4e94-9cc6-11ccbec9f836]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=37f2dcfa-29e0-41fc-bc6e-0b7743a949a7]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9bf15728-3e4b-40ab-8983-44c8c61be0aa]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c257419a-9122-41ad-8924-a5f5de257fee]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e98ba833-e8a8-423d-b34d-0748fa595d7d]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8b809df1-d101-4ec5-a51a-d6a7d316f1a3]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9c8334cf-d52d-48df-9fed-7166277c728d]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-1651.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=275afbb5-a299-4a75-afa9-d409c0bd2ca3]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3c98e029-5dc2-4536-8a1d-49a15749771e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2491e226-7bee-491e-8fb9-f431a07a762e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=48836d07-ea8c-4e3e-8d54-32040f204ba4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d74df522-b36e-4221-8e7c-c63e6f46671c]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e05a4562-037d-485d-9330-ccafb395ccd4]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d9de921f-2054-4a1b-b31a-d856e30904cf]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f60d522a-bb6a-428d-9508-6a60da19bc7f]
module.keycloak_prod.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0791fab7-a968-4a2e-beb6-3e26a7076af4]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6961216b-03c5-4a66-85e1-85b635a8688f]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0bf51902-fe6e-4933-9a2e-3587bc1f7e21]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=00a88062-3c3f-40e2-88ba-4386989a98ae]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=01a3dda3-222e-4333-a03c-64ac403d455b]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=98df6583-d5da-4a9d-897b-d505480e0853]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=651c2666-d4a2-4bab-a268-18f161e7be13]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=434ce153-1f2c-479a-9815-9599d0789951]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ad6dc910-9455-4006-8e39-c451b166e763]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=73c5a213-c962-4718-8e7a-7bae222abc70]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2114.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=342de6e9-a833-4524-9fc0-43d8f9c21936]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=426501a3-8eff-48bc-8216-6000ef9ad84c]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=847f67e1-c8ac-4881-9ade-703fb4c582c6]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d6d6845b-d9f9-44f6-a427-47147f6344d1]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=43fecae7-7883-4cc2-8ef3-2f7f941150de]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d6141814-40e2-479c-a691-d64d7802ddf8]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bad3adaa-9168-474b-939c-fa76bce5abbd]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a21f3696-f9a4-4f0d-9e8f-11a758a5f0a4]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d8d72800-f179-40fa-8989-ea674bd4ba0e]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7ba2f229-db56-4985-b6cb-34a7d19bc7ff]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=360b0018-e4e9-49cf-9fc3-d31c2d13dc47]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83a6c9a7-f80e-4e4d-a32f-6aad6fa5ab2a]
module.keycloak_prod.module.onestopauth.module.client_test-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=38930472-2ded-487b-8ac5-433e0dd705be]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=de8c8e02-51e2-48f3-945a-2c0b86bec3ae]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a22dfce7-390e-4905-ba52-11bce6cfe65f]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1b7c9a8-8e62-4037-bce5-9cdaede715eb]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=615b359d-d806-4edd-b520-c46063c003b8]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=557ba65a-8d4a-45c0-a380-16b32950f7ba]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aab8a048-b9d9-4067-ae21-c512b528d7ea]
module.keycloak_prod.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8ce83e34-082c-441b-b833-a24a439f67f8]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fa9c42ef-c731-490e-8cdb-15dcf00d6565]
module.keycloak_prod.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=49d7d572-0cbf-43b6-9037-2c649bd5f6b7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "local-bceid-2-6"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "local-bceid-2-6"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "local-bceid-2-6"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "local-bceid-2-6"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "local-bceid-2-6"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "local-bceid-2-6"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_prod.module.onestopauth_basic.module.client_local-bceid-2-6.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "local-bceid-2-6"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "local-bceid-2-6"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3564 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*